G-JE/Tsunami/WaveBee/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTA18 (pin M12) is configured as PTA18 */
    PORT_SetPinMux(BOARD_INITPINS_EXTAL0_PORT, BOARD_INITPINS_EXTAL0_PIN, kPORT_MuxAsGpio);

    /* PORTA19 (pin M11) is configured as PTA19 */
    PORT_SetPinMux(BOARD_INITPINS_XTAL0_PORT, BOARD_INITPINS_XTAL0_PIN, kPORT_MuxAsGpio);

    /* PORTA25 (pin J12) is configured as PTA25 */
    PORT_SetPinMux(BOARD_INITPINS_CMP3_IN5_PORT, BOARD_INITPINS_CMP3_IN5_PIN, kPORT_MuxAsGpio);

    /* PORTB10 (pin E12) is configured as ADC1_SE14 */
    PORT_SetPinMux(BOARD_INITPINS_PTB10_RC_PORT, BOARD_INITPINS_PTB10_RC_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB11 (pin E11) is configured as ADC1_SE15 */
    PORT_SetPinMux(BOARD_INITPINS_PTB11_RC_PORT, BOARD_INITPINS_PTB11_RC_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB16 (pin E10) is configured as UART0_RX */
    PORT_SetPinMux(BOARD_INITPINS_DEBUG_UART_RX_PORT, BOARD_INITPINS_DEBUG_UART_RX_PIN, kPORT_MuxAlt3);

    /* PORTB17 (pin E9) is configured as UART0_TX */
    PORT_SetPinMux(BOARD_INITPINS_DEBUG_UART_TX_PORT, BOARD_INITPINS_DEBUG_UART_TX_PIN, kPORT_MuxAlt3);

    /* PORTB2 (pin G12) is configured as ADC0_SE12 */
    PORT_SetPinMux(BOARD_INITPINS_ADC0_SE12_PORT, BOARD_INITPINS_ADC0_SE12_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB3 (pin G11) is configured as ADC0_SE13 */
    PORT_SetPinMux(BOARD_INITPINS_ADC0_SE13_PORT, BOARD_INITPINS_ADC0_SE13_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB4 (pin G10) is configured as ADC1_SE10 */
    PORT_SetPinMux(BOARD_INITPINS_ADC1_SE10_PORT, BOARD_INITPINS_ADC1_SE10_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB5 (pin G9) is configured as ADC1_SE11 */
    PORT_SetPinMux(BOARD_INITPINS_ADC1_SE11_PORT, BOARD_INITPINS_ADC1_SE11_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB6 (pin F12) is configured as ADC1_SE12 */
    PORT_SetPinMux(BOARD_INITPINS_ADC1_SE12_PORT, BOARD_INITPINS_ADC1_SE12_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB7 (pin F11) is configured as ADC1_SE13 */
    PORT_SetPinMux(BOARD_INITPINS_ADC1_SE13_PORT, BOARD_INITPINS_ADC1_SE13_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC0 (pin B12) is configured as PTC0 */
    PORT_SetPinMux(BOARD_INITPINS_ADC0_SE14_PORT, BOARD_INITPINS_ADC0_SE14_PIN, kPORT_MuxAsGpio);

    /* PORTC1 (pin B11) is configured as I2S0_TXD0 */
    PORT_SetPinMux(BOARD_INITPINS_I2S_TXD_PORT, BOARD_INITPINS_I2S_TXD_PIN, kPORT_MuxAlt6);

    const port_pin_config_t I2C1_SCL = {/* Internal pull-up resistor is enabled */
                                        kPORT_PullUp,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Passive filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Open drain is enabled */
                                        kPORT_OpenDrainEnable,
                                        /* Low drive strength is configured */
                                        kPORT_LowDriveStrength,
                                        /* Pin is configured as I2C1_SCL */
                                        kPORT_MuxAlt2,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORTC10 (pin C7) is configured as I2C1_SCL */
    PORT_SetPinConfig(BOARD_INITPINS_I2C1_SCL_PORT, BOARD_INITPINS_I2C1_SCL_PIN, &I2C1_SCL);

    const port_pin_config_t I2C1_SDA = {/* Internal pull-up resistor is enabled */
                                        kPORT_PullUp,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Passive filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Open drain is enabled */
                                        kPORT_OpenDrainEnable,
                                        /* Low drive strength is configured */
                                        kPORT_LowDriveStrength,
                                        /* Pin is configured as I2C1_SDA */
                                        kPORT_MuxAlt2,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORTC11 (pin B7) is configured as I2C1_SDA */
    PORT_SetPinConfig(BOARD_INITPINS_I2C1_SDA_PORT, BOARD_INITPINS_I2C1_SDA_PIN, &I2C1_SDA);

    /* PORTC6 (pin C8) is configured as I2S0_MCLK */
    PORT_SetPinMux(BOARD_INITPINS_I2S_MCLK_PORT, BOARD_INITPINS_I2S_MCLK_PIN, kPORT_MuxAlt6);

    /* PORTD0 (pin A5) is configured as PTD0 */
    PORT_SetPinMux(BOARD_INITPINS_SPI0_PCS0_PORT, BOARD_INITPINS_SPI0_PCS0_PIN, kPORT_MuxAsGpio);

    /* PORTD1 (pin D4) is configured as PTD1 */
    PORT_SetPinMux(BOARD_INITPINS_SPI0_SCK_PORT, BOARD_INITPINS_SPI0_SCK_PIN, kPORT_MuxAsGpio);

    const port_pin_config_t SDCARD_CARD_DETECTION = {/* Internal pull-up resistor is enabled */
                                                     kPORT_PullUp,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Pin is configured as PTD10 */
                                                     kPORT_MuxAsGpio,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORTD10 (pin B3) is configured as PTD10 */
    PORT_SetPinConfig(BOARD_INITPINS_SDCARD_CARD_DETECTION_PORT, BOARD_INITPINS_SDCARD_CARD_DETECTION_PIN, &SDCARD_CARD_DETECTION);

    /* PORTD12 (pin B1) is configured as PTD12 */
    PORT_SetPinMux(BOARD_INITPINS_FB_A20_PORT, BOARD_INITPINS_FB_A20_PIN, kPORT_MuxAsGpio);

    /* PORTD13 (pin C3) is configured as PTD13 */
    PORT_SetPinMux(BOARD_INITPINS_FB_A21_PORT, BOARD_INITPINS_FB_A21_PIN, kPORT_MuxAsGpio);

